[
   {
    "name": "installapp",
    "description": "Install or remove CPTD command as Windows desktop app",
    "long_description": "The installapp command is a utility for CPTD CLI that allows users to create or remove desktop shortcuts for installed CPTD commands on Windows systems. With a simple terminal instruction, users can instantly integrate any CPTD command into their workflow as a clickable application. Shortcuts are created automatically in both the Start Menu and on the Desktop, with support for custom .ico or .png icons. The tool ensures seamless access to CPTD commands without the need to open a terminal each time. Removing shortcuts is just as simple using the --delete flag. The process is entirely automated — no manual file movement or system configuration is required.",
    "version": "1.0",
    "target": "Windows",
    "entrypoint": "installapp.py",
    "dependencies": ["pywin32"],
    "author": "CRYPTOPROTOS",
    "email": "support@cryptoprotos.tech",
    "download": "https://github.com/asbjornrasen/cptd-plugin-installapp-win/raw/refs/heads/main/installapp.zip",
    "website": "https://www.cryptoprotos.tech",
    "license": "https://github.com/asbjornrasen/cptd-plugin-installapp-win/raw/refs/heads/main/license.md",
    "documentation":"https://github.com/asbjornrasen/cptd-plugin-installapp-win/raw/refs/heads/main/README.md"
  },
   {
    "name": "installapp",
    "description": "Install or remove CPTD command as Linux desktop app",
    "long_description": "The installapp command is a utility for CPTD CLI that allows users to create or remove desktop shortcuts for installed CPTD commands on Linux systems. With a simple terminal instruction, users can instantly integrate any CPTD command into their workflow as a clickable application. Shortcuts are created automatically in both the Start Menu and on the Desktop, with support for custom .ico or .png icons. The tool ensures seamless access to CPTD commands without the need to open a terminal each time. Removing shortcuts is just as simple using the --delete flag. The process is entirely automated — no manual file movement or system configuration is required.",
    "version": "1.0",
    "target": "Linux",
    "entrypoint": "installapp.py",
    "dependencies": ["pywin32"],
    "author": "CRYPTOPROTOS",
    "email": "support@cryptoprotos.tech",
    "download": "https://github.com/asbjornrasen/cptd-plugin-installapp-lin/raw/refs/heads/main/installapp.zip",
    "website": "https://www.cryptoprotos.tech",
    "license": "https://github.com/asbjornrasen/cptd-plugin-installapp-lin/raw/refs/heads/main/license.md",
    "documentation":"https://github.com/asbjornrasen/cptd-plugin-installapp-lin/raw/refs/heads/main/README.md"
  },
   {
    "name": "testapp",
    "description": "A demo command for testing the installapp utility. Creates a simple console message to confirm that shortcuts work correctly when launched from the desktop or Start Menu.",
    "long_description": "testapp is a sample CPTD CLI command designed for testing the functionality of the installapp tool. It simply prints a message to the console, confirming that the command was successfully launched. This command is ideal for verifying that CPTD shortcuts created by installapp are configured correctly, open in a terminal, and execute as expected. No additional arguments are required. The purpose of testapp is purely demonstrational and can be safely removed after testing. It is fully cross-platform and compatible with both Windows and Linux systems that support CPTD CLI.",
    "version": "1.0",
    "target": "All",
    "entrypoint": "testapp.py",
    "dependencies": [""],
    "author": "CRYPTOPROTOS",
    "email": "support@cryptoprotos.tech",
    "download": "https://github.com/asbjornrasen/cptd-plugin-testapp/raw/refs/heads/main/testapp.zip",
    "website": "https://www.cryptoprotos.tech",
    "license": "https://github.com/asbjornrasen/cptd-plugin-testapp/raw/refs/heads/main/license.md",
    "documentation":"https://github.com/asbjornrasen/cptd-plugin-testapp/raw/refs/heads/main/readme.md"
 },
  {
    "name": "gateway",
    "description": "Shows active gateways and open ports (Linux only)",
    "long_description": "The gateway command is a CPTD CLI utility designed specifically for Linux systems. It provides detailed insights into the system’s network routing and port status. With a simple syntax and fast execution, gateway helps developers and administrators inspect the default gateway, view all routing entries, and list currently open TCP and UDP ports. The command supports a range of filtering options through flags such as --only-gateway, --only-ports, --tcp, --udp, and --all. Results can also be saved directly to a file using --save <filename>. Internally, the tool leverages system utilities like ip route, ss, and netstat (if available), ensuring compatibility across most Linux environments. One of the key features is its modular filtering logic. Whether you're debugging a connectivity issue, monitoring listening ports, or just performing routine checks, gateway provides fast and readable outputs. It is particularly useful in containerized or virtualized environments where minimal tools are available and quick inspection is essential. This command includes a platform check using ensure_compatible(), and will self-remove if executed on an unsupported OS. Lightweight, safe, and efficient, gateway brings practical network visibility into the CPTD CLI ecosystem.",
    "version": "1.0",
    "target": "Linux",
    "entrypoint": "gateway.py",
    "dependencies": ["colorama"],
    "author": "Asbjorn Rasen",
    "email": "asbjornrasen@gmail.com",
    "download": "https://github.com/asbjornrasen/cptd-plugin-gateway/raw/refs/heads/main/gateway.zip",
    "website": "https://www.cryptoprotos.tech",
    "license": "https://github.com/asbjornrasen/cptd-plugin-gateway/raw/refs/heads/main/license.md",
    "documentation":"https://github.com/asbjornrasen/cptd-plugin-gateway/raw/refs/heads/main/README.md"
  }
]

